Revit 2027 API
ViewSchedule.GetValidFamiliesForNoteBlock Method
 Gets a list of families that can be used for a note block.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetValidFamiliesForNoteBlock(
	Document document
)
Public Shared Function GetValidFamiliesForNoteBlock (
	document As Document
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetValidFamiliesForNoteBlock(
	Document^ document
)
static member GetValidFamiliesForNoteBlock :
        document : Document -> ICollection<ElementId>
Parameters
document Document
 The document.
Return Value
ICollection<ElementId>
 The IDs of all valid families.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace